rpi5-1/20240118-1547/6-locks-only/1000/pgbench-warmup-25-0.log
pgbench (17devel)
transaction type: <builtin: select only>
scaling factor: 25
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2809989
number of failed transactions: 0 (0.000%)
latency average = 0.683 ms
initial connection time = 45.702 ms
tps = 46844.941653 (without initial connection time)